#+TITLE: 用 Emacs Lisp 调用 LanguageTool HTTP API

+[[https://github.com/mhayashi1120/Emacs-langtool][langtool.el]] 用的是命令行版+ (现在也支持 HTTP API 了) ，我们来试试用 HTTP API。

虽然我并没有用 LanguageTool，甚至连 FlySpell 也很少用，但我觉得应该用。langtool.el 的一个问题只支持纯文本，不支持 Markdown、Org Mode 等标记语言，就连注释、字符串貌似也不行。

*** 后续？

接下来是怎么处理 Markdown、注释、字符串了。

应该需要吧 Emacs is *awesome*. 解析成；

#+BEGIN_SRC elisp
(json-encode
 '(("annotation" . (((text . "Emacs is ") (markup . "*") (text . "awesome") (markup . "*") (text . "."))))))
#+END_SRC

#+RESULTS:
: {"annotation":[{"text":"Emacs is ","markup":"*","text":"awesome","markup":"*","text":"."}]}

把不需要检查的放到 markup 中。试试 Pandoc ?

#+BEGIN_SRC sh :results output :wrap src json
echo -n "Emacs is *awesome*." | pandoc -f markdown -t json | jq
#+END_SRC

#+RESULTS:
#+BEGIN_src json
{
  "blocks": [
    {
      "t": "Para",
      "c": [
        {
          "t": "Str",
          "c": "-n"
        },
        {
          "t": "Space"
        },
        {
          "t": "Str",
          "c": "Emacs"
        },
        {
          "t": "Space"
        },
        {
          "t": "Str",
          "c": "is"
        },
        {
          "t": "Space"
        },
        {
          "t": "Emph",
          "c": [
            {
              "t": "Str",
              "c": "awesome"
            }
          ]
        },
        {
          "t": "Str",
          "c": "."
        }
      ]
    }
  ],
  "pandoc-api-version": [
    1,
    17,
    5,
    4
  ],
  "meta": {}
}
#+END_src

也不容易。

Parsec, tree-sitter?
